<a href="https://colab.research.google.com/github/jenrios14/Data-Science-FEM-Study-Group/blob/master/Taller_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Titanic

In [0]:
# Importando librerias
import pandas as pd
# Cargamos el archivo
titanic = pd.read_csv("train.csv")

In [0]:
titanic.head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [0]:
titanic.tail(2)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[2 rows x 12 columns]

In [0]:
titanic.shape

(891, 12)

In [0]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [0]:
titanic.isnull()

     PassengerId  Survived  Pclass   Name  ...  Ticket   Fare  Cabin  Embarked
0          False     False   False  False  ...   False  False   True     False
1          False     False   False  False  ...   False  False  False     False
2          False     False   False  False  ...   False  False   True     False
3          False     False   False  False  ...   False  False  False     False
4          False     False   False  False  ...   False  False   True     False
..           ...       ...     ...    ...  ...     ...    ...    ...       ...
886        False     False   False  False  ...   False  False   True     False
887        False     False   False  False  ...   False  False  False     False
888        False     False   False  False  ...   False  False   True     False
889        False     False   False  False  ...   False  False  False     False
890        False     False   False  False  ...   False  False   True     False

[891 rows x 12 columns]

In [0]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [0]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [0]:
titanic.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [0]:
titanic.describe(include = ['O'])

                                     Name   Sex    Ticket        Cabin Embarked
count                                 891   891       891          204      889
unique                                891     2       681          147        3
top     Andersson, Miss. Sigrid Elisabeth  male  CA. 2343  C23 C25 C27        S
freq                                    1   577         7            4      644

In [0]:
titanic.nunique

<bound method DataFrame.nunique of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>

In [0]:
titanic.nunique(dropna=False)

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             89
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          148
Embarked         4
dtype: int64

In [0]:
titanic.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [0]:
titanic['Embarked'].mode()

0    S
dtype: object

In [0]:
titanic['Sex'].mode()

0    male
dtype: object

In [0]:
titanic['Sex'].unique()

array(['male', 'female'], dtype=object)

In [0]:
titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [0]:
titanic['Sex'].value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [0]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

TALLER

In [0]:
titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [0]:
titanic['Age'].mode()

0    24.0
dtype: float64

In [6]:
titanic['Sex']=='female'

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: Sex, Length: 891, dtype: bool

In [7]:
titanic[titanic['Sex']=='female']['Age'].mode()

0    24.0
dtype: float64

In [8]:
titanic[titanic['Sex']=='male']['Age'].mode()

0    19.0
1    25.0
2    28.0
dtype: float64

In [0]:
titanic['Fare'].mode()

0    8.05
dtype: float64

In [9]:
titanic[titanic['Sex']=='female']['Fare'].mode()

0    7.75
dtype: float64

In [10]:
titanic[titanic['Sex']=='male']['Fare'].mode()

0    8.05
dtype: float64

In [14]:
F = titanic[titanic['Sex']=='female']['Fare'].mode()
M = titanic[titanic['Sex']=='male']['Fare'].mode()
print(F,M)

0    7.75
dtype: float64 0    8.05
dtype: float64